{"data":{"site":{"siteMetadata":{"title":"The Blog","author":"Sirrah23"}},"markdownRemark":{"id":"6f1f746a-3c88-56ad-b18e-fb5043df18c5","excerpt":"Introduction When I first started programming, my problem solving approach was haphazard. When I needed to implement something, I would think about it for a few…","html":"<h1>Introduction</h1>\n<p>When I first started programming, my problem solving approach was haphazard. When I needed to implement something, I would think about it for a few minutes, and then go off and start banging my head against an editor. Staring at the screen for hours, I’d slowly slog through it. However, everything changed when I started keeping a digital engineering notebook. I am now a much more effective individual and collaborator.</p>\n<h1>What is an engineering notebook?</h1>\n<p>An engineering notebook consists of a series of notes that you keep for yourself while working on a given project or problem. In my case, everyday I create a new page in the section designated for my current project and begin free writing my thoughts on the problem at hand. These notes are generally for my eyes only. I fill the page with goal statements, step-by-step high level solutions, links to relevant information, and more. If I want to know what I was doing or thinking on any given day I can jump to the log entry for that day and give it a read.</p>\n<h1>Why do I keep an engineering notebook?</h1>\n<p>I’ve experienced many benefits since I started keeping an engineering log:</p>\n<ul>\n<li>\n<p><strong>It gives me a place to start.</strong> Before the engineering notebook, when I tried to solve a problem, I would stare at the screen, frustrated that I wasn’t making any progress. Now I just start by writing down what I know right now, what I don’t know, avenues to explore, and things to try. The act of writing  problem-solving kick starter.</p>\n</li>\n<li>\n<p><strong>It lowers my stress levels.</strong> Capturing anything and everything in your head is one of the core step’s in David Allen’s GTD methodology. David argues that having an uncaptured item floating around in your head applies a psychic weight on you which weighs you down and stresses you out. I believe that this same concept applies not just to todo lists, but to technical problem solving. For any given problem there’s a lot of context involved and if I don’t write it down it just floats around in my head. However, by writing it down, I release it’s hold on me, and alleviate the pressure of any lingering psychic weight. This reduces my stress and improves my focus.</p>\n</li>\n<li>\n<p><strong>I can catch potential problems sooner.</strong> The worst thing that can happen to me, when I’m working on a technical problem, is realizing that I missed a very important detail early in analysis. It means I now need to go back and do some heavy, error-prone rework, while facing a  now tight deadline. Had I given some more thought to the problem upfront, I could have caught those little details, and worked them into my solution. Keeping an engineering notebook helps facilitate this. Early in the problem solving process, when I dump everything in my head onto the page, I suddenly start making connections and begin asking questions otherwise would have remained hidden. The act of writing can help the brain remember important information, or consider an avenue that it otherwise wouldn’t have.</p>\n</li>\n<li>\n<p><strong>It helps me keep my place.</strong> When I go on a long vacation or switch gears for a while, anything related to what I was working previously floats away disappears from my mind. It’s a gift and a curse. When I come back to the project later, I’d typically be left scratching my head. However,  what I do now is go to the most recent page in the project’s engineering notebook and start reading it. This helps me get back up to speed quickly. This is also useful when I’m interrupted in the middle of a task. When I come back to what I was doing pre-interruption I can give my notes a quick glance reload the lost context into my working memory.</p>\n</li>\n<li>\n<p><strong>I can justify my decisions.</strong> When I propose a solution as a programmer, or solve a problem in a certain way, my collaborators will sometimes ask me what advantages my solution has, or why I decided to go with solution A instead of solution B. These questions are easier to answer now because my justifications are written in my engineering notebook. This content is even more valuable when I need to come back months later to try to help someone understand why something was done a certain way.</p>\n</li>\n</ul>\n<h1>What kinds of things do I write down?</h1>\n<p>There are so many things that someone could write in an eingineering notebook. What kinds of things are worth recording? Here are just some of the things that I record:</p>\n<ul>\n<li><strong>Relevant parts of story cards or requirements</strong> </li>\n<li><strong>High-level approaches for solving a given problem,</strong> quickly jotting down a high level approach to how I’m going to solve something is valuable. I can cross off each step as its implemented, or re-arrange things before I start writing code.</li>\n<li><strong>Things to follow-up on later</strong></li>\n<li><strong>Screenshots</strong></li>\n<li><strong>Conclusions from any investigations and/or deadends,</strong> I will note down functions I looked at, or relevant code snippets. This helps me avoid having to do it again later.</li>\n<li><strong>Links to relevant emails or websites</strong></li>\n<li><strong>Temporarily important information, like a server ip or test data</strong></li>\n</ul>\n<h1>Some relevant resources to review</h1>\n<p>Keeping an engineering log is not an idea I came up with on my own. Here are some relevant resources from where I picked up some ideas on this topic:</p>\n<ul>\n<li><a href=\"https://en.wikibooks.org/wiki/General_Engineering_Introduction/Notebooks\">https://en.wikibooks.org/wiki/General<em>Engineering</em>Introduction/Notebooks</a></li>\n<li><a href=\"https://plaintext-productivity.net/2-09-work-journal.html\">https://plaintext-productivity.net/2-09-work-journal.html</a></li>\n</ul>\n<p>Also check out <a href=\"https://hamberg.no/gtd/\">GTD</a>, which I mentioned above.</p>\n<h1>Conclusion</h1>\n<p>As you can see, I’ve benefitted a lot from keeping an engineering notebook. While it’s not a silver bullet by any means, it’s easy enough to get started that I think you should give it a shot. You might end up liking it more than you think.</p>","frontmatter":{"title":"Keeping an engineering notebook","date":"June 24, 2019","description":""}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/engineering-notebook/","previous":{"fields":{"slug":"/firefox-treestyletab-tip/"},"frontmatter":{"title":"Optimizing your Tree Style Tab experience with groups"}},"next":null}}