{"data":{"site":{"siteMetadata":{"title":"The Blog","author":"Sirrah23"}},"markdownRemark":{"id":"0db3ba16-1854-550f-8971-e93ce455241f","excerpt":"Introduction A typical organization has two kinds of workers: readers and non-readers. Readers take the time to consume written information like emails, design…","html":"<h1>Introduction</h1>\n<p>A typical organization has two kinds of workers: readers and non-readers. Readers take the time to consume written information like emails, design documents, wiki pages, and code, before proceeding in further communication. Non-readers, however, will skip that step of the communication process and either start organizing meetings or begin working on their tasks. This leads to a lot of unnecessary meetings and rework.</p>\n<p>Organizations need more readers and less non-readers, especially in the age of remote, asynchronous work.</p>\n<h1>The symptoms of non-reader majority organizations</h1>\n<p>A organization that consists mostly of non-readers will tend to fall into behavior traps that are the antithesis of asynchronous and remote work. For example:</p>\n<ul>\n<li><strong>There are a lot of meetings.</strong> Emails are written, memos are sent, and design documents are up for review. However, nobody bothers to take a look at them. Instead, people  choose to physically gather around later and verbally discuss what’s already been written, and in extreme cases simply read documents and emails aloud together. This is a massive waste of time and the synchronicity of it hinders an organization’s ability to scale out of its physical location.</li>\n<li><strong>A lot of major decisions are made at the “watercooler”.</strong> A lack of reading permeates the culture of an organization to the point where nothing is written down. Major decisions are made on the fly and communicated to the relevant parties at the last possible second. This leads to a lot of churn.</li>\n<li><strong>There’s a lot of rework.</strong> Conversations are had, decisions are made, and action items are captured. However, people either don’t review or misinterpret what’s been written and end up working on the wrong things. Because of this a lot of work needs to be redone.</li>\n<li><strong>There’s a lot of impatience.</strong> Taking the time to read something requires patience. However, in an organization of non-readers, there will be a severe lack of it. This leads to the classic situation where an email becomes a chat message, which becomes a tap on the shoulder, all within the span of a few minutes. If people could rest assured that others were taking the time to read, understand, and respond to their communications, then they would be able to sit back and be patient.</li>\n</ul>\n<h1>How can organizations convert non-readers into readers?</h1>\n<p>An organization needs to convert their non-readers into readers. They can start by:</p>\n<ul>\n<li><strong>Encouraging thoughtful writing.</strong> Reading and writing are two sides of the same coin. Your writing is more likely to be read if it’s thoughtfully constructed. Sometimes people don’t like to read simply because it’s hard to navigate the labyrinth that is the typical office document.</li>\n<li><strong>Asking workers to have more patience.</strong> We’re always rushing to slam tasks off of our todo lists. While one will certainly make progress this way, the distance travelled won’t be far. Taking the time to communicate well, and consuming communication thoughtfully is likely to slow you down at first, but you’ll end up traveling much further in the long run. </li>\n<li><strong>Insisting that people read relevant communications before calling a meeting.</strong> Anything worth discussing should be written down and shared with the team. Any further communication on the topic should be communicated textually. If, however, a meeting is called, then everyone should be expected to have read up on the topic, or that the <a href=\"https://www.cnbc.com/2018/04/23/what-jeff-bezos-learned-from-requiring-6-page-memos-at-amazon.html\">first few minutes of the meeting are dedicated to reading</a>.</li>\n<li><strong>Adopting better tools.</strong> Email is not always the best format for written discussion because it can become unwieldy for readers to follow. Using a tool that supports threaded discussion as a first-class concept can help with this. I’ve heard of organizations out there using an internal <a href=\"https://www.discourse.org/\">Discourse</a> instance to facilitate threaded, <a href=\"https://www.reddit.com/\">Reddit</a>-like discussions. If your organization develops software then putting all of your discussions in issues, as supported by <a href=\"https://guides.github.com/features/issues/\">Github</a> or <a href=\"https://docs.gitlab.com/ee/user/project/issues/\">Gitlab</a>, might be even better.</li>\n</ul>\n<h1>Caveats</h1>\n<p>Not everything is worth reading, this is just a fact of life. However, that is no excuse to never read <strong>anything</strong>. Reading isn’t just an act, but a practice, and by doing it over-and-over again, one gets better at distinguishing between things that should be read, and things that should be ignored.</p>\n<h1>Conclusion</h1>\n<p>Reading is critical for the success of any modern organization. If you want to scale your organization then you should encourage everyone, as much as possible, to become readers.</p>","frontmatter":{"title":"Readers will scale your organization","date":"July 21, 2019","description":""}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/readers-scale-organizations/","previous":{"fields":{"slug":"/engineering-notebook/"},"frontmatter":{"title":"Keeping an engineering notebook"}},"next":null}}